GopalSaraf/Practicals/PSDL/include/proc/pic16f1786.inc
// Register: IOCCN
#define IOCCN IOCCN
IOCCN                                    equ 0398h
// bitfield definitions
IOCCN_IOCCN0_POSN                        equ 0000h
IOCCN_IOCCN0_POSITION                    equ 0000h
IOCCN_IOCCN0_SIZE                        equ 0001h
IOCCN_IOCCN0_LENGTH                      equ 0001h
IOCCN_IOCCN0_MASK                        equ 0001h
IOCCN_IOCCN1_POSN                        equ 0001h
IOCCN_IOCCN1_POSITION                    equ 0001h
IOCCN_IOCCN1_SIZE                        equ 0001h
IOCCN_IOCCN1_LENGTH                      equ 0001h
IOCCN_IOCCN1_MASK                        equ 0002h
IOCCN_IOCCN2_POSN                        equ 0002h
IOCCN_IOCCN2_POSITION                    equ 0002h
IOCCN_IOCCN2_SIZE                        equ 0001h
IOCCN_IOCCN2_LENGTH                      equ 0001h
IOCCN_IOCCN2_MASK                        equ 0004h
IOCCN_IOCCN3_POSN                        equ 0003h
IOCCN_IOCCN3_POSITION                    equ 0003h
IOCCN_IOCCN3_SIZE                        equ 0001h
IOCCN_IOCCN3_LENGTH                      equ 0001h
IOCCN_IOCCN3_MASK                        equ 0008h
IOCCN_IOCCN4_POSN                        equ 0004h
IOCCN_IOCCN4_POSITION                    equ 0004h
IOCCN_IOCCN4_SIZE                        equ 0001h
IOCCN_IOCCN4_LENGTH                      equ 0001h
IOCCN_IOCCN4_MASK                        equ 0010h
IOCCN_IOCCN5_POSN                        equ 0005h
IOCCN_IOCCN5_POSITION                    equ 0005h
IOCCN_IOCCN5_SIZE                        equ 0001h
IOCCN_IOCCN5_LENGTH                      equ 0001h
IOCCN_IOCCN5_MASK                        equ 0020h
IOCCN_IOCCN6_POSN                        equ 0006h
IOCCN_IOCCN6_POSITION                    equ 0006h
IOCCN_IOCCN6_SIZE                        equ 0001h
IOCCN_IOCCN6_LENGTH                      equ 0001h
IOCCN_IOCCN6_MASK                        equ 0040h
IOCCN_IOCCN7_POSN                        equ 0007h
IOCCN_IOCCN7_POSITION                    equ 0007h
IOCCN_IOCCN7_SIZE                        equ 0001h
IOCCN_IOCCN7_LENGTH                      equ 0001h
IOCCN_IOCCN7_MASK                        equ 0080h
IOCCN_IOCCN_POSN                         equ 0000h
IOCCN_IOCCN_POSITION                     equ 0000h
IOCCN_IOCCN_SIZE                         equ 0008h
IOCCN_IOCCN_LENGTH                       equ 0008h
IOCCN_IOCCN_MASK                         equ 00FFh

// Register: IOCCF
#define IOCCF IOCCF
IOCCF                                    equ 0399h
// bitfield definitions
IOCCF_IOCCF0_POSN                        equ 0000h
IOCCF_IOCCF0_POSITION                    equ 0000h
IOCCF_IOCCF0_SIZE                        equ 0001h
IOCCF_IOCCF0_LENGTH                      equ 0001h
IOCCF_IOCCF0_MASK                        equ 0001h
IOCCF_IOCCF1_POSN                        equ 0001h
IOCCF_IOCCF1_POSITION                    equ 0001h
IOCCF_IOCCF1_SIZE                        equ 0001h
IOCCF_IOCCF1_LENGTH                      equ 0001h
IOCCF_IOCCF1_MASK                        equ 0002h
IOCCF_IOCCF2_POSN                        equ 0002h
IOCCF_IOCCF2_POSITION                    equ 0002h
IOCCF_IOCCF2_SIZE                        equ 0001h
IOCCF_IOCCF2_LENGTH                      equ 0001h
IOCCF_IOCCF2_MASK                        equ 0004h
IOCCF_IOCCF3_POSN                        equ 0003h
IOCCF_IOCCF3_POSITION                    equ 0003h
IOCCF_IOCCF3_SIZE                        equ 0001h
IOCCF_IOCCF3_LENGTH                      equ 0001h
IOCCF_IOCCF3_MASK                        equ 0008h
IOCCF_IOCCF4_POSN                        equ 0004h
IOCCF_IOCCF4_POSITION                    equ 0004h
IOCCF_IOCCF4_SIZE                        equ 0001h
IOCCF_IOCCF4_LENGTH                      equ 0001h
IOCCF_IOCCF4_MASK                        equ 0010h
IOCCF_IOCCF5_POSN                        equ 0005h
IOCCF_IOCCF5_POSITION                    equ 0005h
IOCCF_IOCCF5_SIZE                        equ 0001h
IOCCF_IOCCF5_LENGTH                      equ 0001h
IOCCF_IOCCF5_MASK                        equ 0020h
IOCCF_IOCCF6_POSN                        equ 0006h
IOCCF_IOCCF6_POSITION                    equ 0006h
IOCCF_IOCCF6_SIZE                        equ 0001h
IOCCF_IOCCF6_LENGTH                      equ 0001h
IOCCF_IOCCF6_MASK                        equ 0040h
IOCCF_IOCCF7_POSN                        equ 0007h
IOCCF_IOCCF7_POSITION                    equ 0007h
IOCCF_IOCCF7_SIZE                        equ 0001h
IOCCF_IOCCF7_LENGTH                      equ 0001h
IOCCF_IOCCF7_MASK                        equ 0080h
IOCCF_IOCCF_POSN                         equ 0000h
IOCCF_IOCCF_POSITION                     equ 0000h
IOCCF_IOCCF_SIZE                         equ 0008h
IOCCF_IOCCF_LENGTH                       equ 0008h
IOCCF_IOCCF_MASK                         equ 00FFh

// Register: IOCEP
#define IOCEP IOCEP
IOCEP                                    equ 039Dh
// bitfield definitions
IOCEP_IOCEP3_POSN                        equ 0003h
IOCEP_IOCEP3_POSITION                    equ 0003h
IOCEP_IOCEP3_SIZE                        equ 0001h
IOCEP_IOCEP3_LENGTH                      equ 0001h
IOCEP_IOCEP3_MASK                        equ 0008h

// Register: IOCEN
#define IOCEN IOCEN
IOCEN                                    equ 039Eh
// bitfield definitions
IOCEN_IOCEN3_POSN                        equ 0003h
IOCEN_IOCEN3_POSITION                    equ 0003h
IOCEN_IOCEN3_SIZE                        equ 0001h
IOCEN_IOCEN3_LENGTH                      equ 0001h
IOCEN_IOCEN3_MASK                        equ 0008h

// Register: IOCEF
#define IOCEF IOCEF
IOCEF                                    equ 039Fh
// bitfield definitions
IOCEF_IOCEF3_POSN                        equ 0003h
IOCEF_IOCEF3_POSITION                    equ 0003h
IOCEF_IOCEF3_SIZE                        equ 0001h
IOCEF_IOCEF3_LENGTH                      equ 0001h
IOCEF_IOCEF3_MASK                        equ 0008h

// Register: OPA1CON
#define OPA1CON OPA1CON
OPA1CON                                  equ 0511h
// bitfield definitions
OPA1CON_OPA1PCH0_POSN                    equ 0000h
OPA1CON_OPA1PCH0_POSITION                equ 0000h
OPA1CON_OPA1PCH0_SIZE                    equ 0001h
OPA1CON_OPA1PCH0_LENGTH                  equ 0001h
OPA1CON_OPA1PCH0_MASK                    equ 0001h
OPA1CON_OPA1PCH1_POSN                    equ 0001h
OPA1CON_OPA1PCH1_POSITION                equ 0001h
OPA1CON_OPA1PCH1_SIZE                    equ 0001h
OPA1CON_OPA1PCH1_LENGTH                  equ 0001h
OPA1CON_OPA1PCH1_MASK                    equ 0002h
OPA1CON_OPA1PCH_POSN                     equ 0000h
OPA1CON_OPA1PCH_POSITION                 equ 0000h
OPA1CON_OPA1PCH_SIZE                     equ 0003h
OPA1CON_OPA1PCH_LENGTH                   equ 0003h
OPA1CON_OPA1PCH_MASK                     equ 0007h
OPA1CON_OPA1SP_POSN                      equ 0006h
OPA1CON_OPA1SP_POSITION                  equ 0006h
OPA1CON_OPA1SP_SIZE                      equ 0001h
OPA1CON_OPA1SP_LENGTH                    equ 0001h
OPA1CON_OPA1SP_MASK                      equ 0040h
OPA1CON_OPA1EN_POSN                      equ 0007h
OPA1CON_OPA1EN_POSITION                  equ 0007h
OPA1CON_OPA1EN_SIZE                      equ 0001h
OPA1CON_OPA1EN_LENGTH                    equ 0001h
OPA1CON_OPA1EN_MASK                      equ 0080h
OPA1CON_PCH_POSN                         equ 0000h
OPA1CON_PCH_POSITION                     equ 0000h
OPA1CON_PCH_SIZE                         equ 0003h
OPA1CON_PCH_LENGTH                       equ 0003h
OPA1CON_PCH_MASK                         equ 0007h
OPA1CON_SP_POSN                          equ 0006h
OPA1CON_SP_POSITION                      equ 0006h
OPA1CON_SP_SIZE                          equ 0001h
OPA1CON_SP_LENGTH                        equ 0001h
OPA1CON_SP_MASK                          equ 0040h
OPA1CON_EN_POSN                          equ 0007h
OPA1CON_EN_POSITION                      equ 0007h
OPA1CON_EN_SIZE                          equ 0001h
OPA1CON_EN_LENGTH                        equ 0001h
OPA1CON_EN_MASK                          equ 0080h
OPA1CON_PCH0_POSN                        equ 0000h
OPA1CON_PCH0_POSITION                    equ 0000h
OPA1CON_PCH0_SIZE                        equ 0001h
OPA1CON_PCH0_LENGTH                      equ 0001h
OPA1CON_PCH0_MASK                        equ 0001h
OPA1CON_PCH1_POSN                        equ 0001h
OPA1CON_PCH1_POSITION                    equ 0001h
OPA1CON_PCH1_SIZE                        equ 0001h
OPA1CON_PCH1_LENGTH                      equ 0001h
OPA1CON_PCH1_MASK                        equ 0002h

// Register: OPA2CON
#define OPA2CON OPA2CON
OPA2CON                                  equ 0513h
// bitfield definitions
OPA2CON_OPA2PCH0_POSN                    equ 0000h
OPA2CON_OPA2PCH0_POSITION                equ 0000h
OPA2CON_OPA2PCH0_SIZE                    equ 0001h
OPA2CON_OPA2PCH0_LENGTH                  equ 0001h
OPA2CON_OPA2PCH0_MASK                    equ 0001h
OPA2CON_OPA2PCH1_POSN                    equ 0001h
OPA2CON_OPA2PCH1_POSITION                equ 0001h
OPA2CON_OPA2PCH1_SIZE                    equ 0001h
OPA2CON_OPA2PCH1_LENGTH                  equ 0001h
OPA2CON_OPA2PCH1_MASK                    equ 0002h
OPA2CON_OPA2PCH_POSN                     equ 0000h
OPA2CON_OPA2PCH_POSITION                 equ 0000h
OPA2CON_OPA2PCH_SIZE                     equ 0003h
OPA2CON_OPA2PCH_LENGTH                   equ 0003h
OPA2CON_OPA2PCH_MASK                     equ 0007h
OPA2CON_OPA2SP_POSN                      equ 0006h
OPA2CON_OPA2SP_POSITION                  equ 0006h
OPA2CON_OPA2SP_SIZE                      equ 0001h
OPA2CON_OPA2SP_LENGTH                    equ 0001h
OPA2CON_OPA2SP_MASK                      equ 0040h
OPA2CON_OPA2EN_POSN                      equ 0007h
OPA2CON_OPA2EN_POSITION                  equ 0007h
OPA2CON_OPA2EN_SIZE                      equ 0001h
OPA2CON_OPA2EN_LENGTH                    equ 0001h
OPA2CON_OPA2EN_MASK                      equ 0080h
OPA2CON_PCH_POSN                         equ 0000h
OPA2CON_PCH_POSITION                     equ 0000h
OPA2CON_PCH_SIZE                         equ 0003h
OPA2CON_PCH_LENGTH                       equ 0003h
OPA2CON_PCH_MASK                         equ 0007h
OPA2CON_SP_POSN                          equ 0006h
OPA2CON_SP_POSITION                      equ 0006h
OPA2CON_SP_SIZE                          equ 0001h
OPA2CON_SP_LENGTH                        equ 0001h
OPA2CON_SP_MASK                          equ 0040h
OPA2CON_EN_POSN                          equ 0007h
OPA2CON_EN_POSITION                      equ 0007h
OPA2CON_EN_SIZE                          equ 0001h
OPA2CON_EN_LENGTH                        equ 0001h
OPA2CON_EN_MASK                          equ 0080h
OPA2CON_PCH0_POSN                        equ 0000h
OPA2CON_PCH0_POSITION                    equ 0000h
OPA2CON_PCH0_SIZE                        equ 0001h
OPA2CON_PCH0_LENGTH                      equ 0001h
OPA2CON_PCH0_MASK                        equ 0001h
OPA2CON_PCH1_POSN                        equ 0001h
OPA2CON_PCH1_POSITION                    equ 0001h
OPA2CON_PCH1_SIZE                        equ 0001h
OPA2CON_PCH1_LENGTH                      equ 0001h
OPA2CON_PCH1_MASK                        equ 0002h

