GopalSaraf/Practicals/PSDL/include/proc/pic16f1786.inc
// Register: PSMC3DCH
#define PSMC3DCH PSMC3DCH
PSMC3DCH                                 equ 0864h
// bitfield definitions
PSMC3DCH_PSMC3DC8_POSN                   equ 0000h
PSMC3DCH_PSMC3DC8_POSITION               equ 0000h
PSMC3DCH_PSMC3DC8_SIZE                   equ 0001h
PSMC3DCH_PSMC3DC8_LENGTH                 equ 0001h
PSMC3DCH_PSMC3DC8_MASK                   equ 0001h
PSMC3DCH_PSMC3DC9_POSN                   equ 0001h
PSMC3DCH_PSMC3DC9_POSITION               equ 0001h
PSMC3DCH_PSMC3DC9_SIZE                   equ 0001h
PSMC3DCH_PSMC3DC9_LENGTH                 equ 0001h
PSMC3DCH_PSMC3DC9_MASK                   equ 0002h
PSMC3DCH_PSMC3DC10_POSN                  equ 0002h
PSMC3DCH_PSMC3DC10_POSITION              equ 0002h
PSMC3DCH_PSMC3DC10_SIZE                  equ 0001h
PSMC3DCH_PSMC3DC10_LENGTH                equ 0001h
PSMC3DCH_PSMC3DC10_MASK                  equ 0004h
PSMC3DCH_PSMC3DC11_POSN                  equ 0003h
PSMC3DCH_PSMC3DC11_POSITION              equ 0003h
PSMC3DCH_PSMC3DC11_SIZE                  equ 0001h
PSMC3DCH_PSMC3DC11_LENGTH                equ 0001h
PSMC3DCH_PSMC3DC11_MASK                  equ 0008h
PSMC3DCH_PSMC3DC12_POSN                  equ 0004h
PSMC3DCH_PSMC3DC12_POSITION              equ 0004h
PSMC3DCH_PSMC3DC12_SIZE                  equ 0001h
PSMC3DCH_PSMC3DC12_LENGTH                equ 0001h
PSMC3DCH_PSMC3DC12_MASK                  equ 0010h
PSMC3DCH_PSMC3DC13_POSN                  equ 0005h
PSMC3DCH_PSMC3DC13_POSITION              equ 0005h
PSMC3DCH_PSMC3DC13_SIZE                  equ 0001h
PSMC3DCH_PSMC3DC13_LENGTH                equ 0001h
PSMC3DCH_PSMC3DC13_MASK                  equ 0020h
PSMC3DCH_PSMC3DC14_POSN                  equ 0006h
PSMC3DCH_PSMC3DC14_POSITION              equ 0006h
PSMC3DCH_PSMC3DC14_SIZE                  equ 0001h
PSMC3DCH_PSMC3DC14_LENGTH                equ 0001h
PSMC3DCH_PSMC3DC14_MASK                  equ 0040h
PSMC3DCH_PSMC3DC15_POSN                  equ 0007h
PSMC3DCH_PSMC3DC15_POSITION              equ 0007h
PSMC3DCH_PSMC3DC15_SIZE                  equ 0001h
PSMC3DCH_PSMC3DC15_LENGTH                equ 0001h
PSMC3DCH_PSMC3DC15_MASK                  equ 0080h

// Register: PSMC3PRL
#define PSMC3PRL PSMC3PRL
PSMC3PRL                                 equ 0865h
// bitfield definitions
PSMC3PRL_PSMC3PR0_POSN                   equ 0000h
PSMC3PRL_PSMC3PR0_POSITION               equ 0000h
PSMC3PRL_PSMC3PR0_SIZE                   equ 0001h
PSMC3PRL_PSMC3PR0_LENGTH                 equ 0001h
PSMC3PRL_PSMC3PR0_MASK                   equ 0001h
PSMC3PRL_PSMC3PR1_POSN                   equ 0001h
PSMC3PRL_PSMC3PR1_POSITION               equ 0001h
PSMC3PRL_PSMC3PR1_SIZE                   equ 0001h
PSMC3PRL_PSMC3PR1_LENGTH                 equ 0001h
PSMC3PRL_PSMC3PR1_MASK                   equ 0002h
PSMC3PRL_PSMC3PR2_POSN                   equ 0002h
PSMC3PRL_PSMC3PR2_POSITION               equ 0002h
PSMC3PRL_PSMC3PR2_SIZE                   equ 0001h
PSMC3PRL_PSMC3PR2_LENGTH                 equ 0001h
PSMC3PRL_PSMC3PR2_MASK                   equ 0004h
PSMC3PRL_PSMC3PR3_POSN                   equ 0003h
PSMC3PRL_PSMC3PR3_POSITION               equ 0003h
PSMC3PRL_PSMC3PR3_SIZE                   equ 0001h
PSMC3PRL_PSMC3PR3_LENGTH                 equ 0001h
PSMC3PRL_PSMC3PR3_MASK                   equ 0008h
PSMC3PRL_PSMC3PR4_POSN                   equ 0004h
PSMC3PRL_PSMC3PR4_POSITION               equ 0004h
PSMC3PRL_PSMC3PR4_SIZE                   equ 0001h
PSMC3PRL_PSMC3PR4_LENGTH                 equ 0001h
PSMC3PRL_PSMC3PR4_MASK                   equ 0010h
PSMC3PRL_PSMC3PR5_POSN                   equ 0005h
PSMC3PRL_PSMC3PR5_POSITION               equ 0005h
PSMC3PRL_PSMC3PR5_SIZE                   equ 0001h
PSMC3PRL_PSMC3PR5_LENGTH                 equ 0001h
PSMC3PRL_PSMC3PR5_MASK                   equ 0020h
PSMC3PRL_PSMC3PR6_POSN                   equ 0006h
PSMC3PRL_PSMC3PR6_POSITION               equ 0006h
PSMC3PRL_PSMC3PR6_SIZE                   equ 0001h
PSMC3PRL_PSMC3PR6_LENGTH                 equ 0001h
PSMC3PRL_PSMC3PR6_MASK                   equ 0040h
PSMC3PRL_PSMC3PR7_POSN                   equ 0007h
PSMC3PRL_PSMC3PR7_POSITION               equ 0007h
PSMC3PRL_PSMC3PR7_SIZE                   equ 0001h
PSMC3PRL_PSMC3PR7_LENGTH                 equ 0001h
PSMC3PRL_PSMC3PR7_MASK                   equ 0080h

// Register: PSMC3PRH
#define PSMC3PRH PSMC3PRH
PSMC3PRH                                 equ 0866h
// bitfield definitions
PSMC3PRH_PSMC3PR8_POSN                   equ 0000h
PSMC3PRH_PSMC3PR8_POSITION               equ 0000h
PSMC3PRH_PSMC3PR8_SIZE                   equ 0001h
PSMC3PRH_PSMC3PR8_LENGTH                 equ 0001h
PSMC3PRH_PSMC3PR8_MASK                   equ 0001h
PSMC3PRH_PSMC3PR9_POSN                   equ 0001h
PSMC3PRH_PSMC3PR9_POSITION               equ 0001h
PSMC3PRH_PSMC3PR9_SIZE                   equ 0001h
PSMC3PRH_PSMC3PR9_LENGTH                 equ 0001h
PSMC3PRH_PSMC3PR9_MASK                   equ 0002h
PSMC3PRH_PSMC3PR10_POSN                  equ 0002h
PSMC3PRH_PSMC3PR10_POSITION              equ 0002h
PSMC3PRH_PSMC3PR10_SIZE                  equ 0001h
PSMC3PRH_PSMC3PR10_LENGTH                equ 0001h
PSMC3PRH_PSMC3PR10_MASK                  equ 0004h
PSMC3PRH_PSMC3PR11_POSN                  equ 0003h
PSMC3PRH_PSMC3PR11_POSITION              equ 0003h
PSMC3PRH_PSMC3PR11_SIZE                  equ 0001h
PSMC3PRH_PSMC3PR11_LENGTH                equ 0001h
PSMC3PRH_PSMC3PR11_MASK                  equ 0008h
PSMC3PRH_PSMC3PR12_POSN                  equ 0004h
PSMC3PRH_PSMC3PR12_POSITION              equ 0004h
PSMC3PRH_PSMC3PR12_SIZE                  equ 0001h
PSMC3PRH_PSMC3PR12_LENGTH                equ 0001h
PSMC3PRH_PSMC3PR12_MASK                  equ 0010h
PSMC3PRH_PSMC3PR13_POSN                  equ 0005h
PSMC3PRH_PSMC3PR13_POSITION              equ 0005h
PSMC3PRH_PSMC3PR13_SIZE                  equ 0001h
PSMC3PRH_PSMC3PR13_LENGTH                equ 0001h
PSMC3PRH_PSMC3PR13_MASK                  equ 0020h
PSMC3PRH_PSMC3PR14_POSN                  equ 0006h
PSMC3PRH_PSMC3PR14_POSITION              equ 0006h
PSMC3PRH_PSMC3PR14_SIZE                  equ 0001h
PSMC3PRH_PSMC3PR14_LENGTH                equ 0001h
PSMC3PRH_PSMC3PR14_MASK                  equ 0040h
PSMC3PRH_PSMC3PR15_POSN                  equ 0007h
PSMC3PRH_PSMC3PR15_POSITION              equ 0007h
PSMC3PRH_PSMC3PR15_SIZE                  equ 0001h
PSMC3PRH_PSMC3PR15_LENGTH                equ 0001h
PSMC3PRH_PSMC3PR15_MASK                  equ 0080h

// Register: PSMC3TMRL
#define PSMC3TMRL PSMC3TMRL
PSMC3TMRL                                equ 0867h
// bitfield definitions
PSMC3TMRL_PSMC3TMR0_POSN                 equ 0000h
PSMC3TMRL_PSMC3TMR0_POSITION             equ 0000h
PSMC3TMRL_PSMC3TMR0_SIZE                 equ 0001h
PSMC3TMRL_PSMC3TMR0_LENGTH               equ 0001h
PSMC3TMRL_PSMC3TMR0_MASK                 equ 0001h
PSMC3TMRL_PSMC3TMR1_POSN                 equ 0001h
PSMC3TMRL_PSMC3TMR1_POSITION             equ 0001h
PSMC3TMRL_PSMC3TMR1_SIZE                 equ 0001h
PSMC3TMRL_PSMC3TMR1_LENGTH               equ 0001h
PSMC3TMRL_PSMC3TMR1_MASK                 equ 0002h
PSMC3TMRL_PSMC3TMR2_POSN                 equ 0002h
PSMC3TMRL_PSMC3TMR2_POSITION             equ 0002h
PSMC3TMRL_PSMC3TMR2_SIZE                 equ 0001h
PSMC3TMRL_PSMC3TMR2_LENGTH               equ 0001h
PSMC3TMRL_PSMC3TMR2_MASK                 equ 0004h
PSMC3TMRL_PSMC3TMR3_POSN                 equ 0003h
PSMC3TMRL_PSMC3TMR3_POSITION             equ 0003h
PSMC3TMRL_PSMC3TMR3_SIZE                 equ 0001h
PSMC3TMRL_PSMC3TMR3_LENGTH               equ 0001h
PSMC3TMRL_PSMC3TMR3_MASK                 equ 0008h
PSMC3TMRL_PSMC3TMR4_POSN                 equ 0004h
PSMC3TMRL_PSMC3TMR4_POSITION             equ 0004h
PSMC3TMRL_PSMC3TMR4_SIZE                 equ 0001h
PSMC3TMRL_PSMC3TMR4_LENGTH               equ 0001h
PSMC3TMRL_PSMC3TMR4_MASK                 equ 0010h
PSMC3TMRL_PSMC3TMR5_POSN                 equ 0005h
PSMC3TMRL_PSMC3TMR5_POSITION             equ 0005h
PSMC3TMRL_PSMC3TMR5_SIZE                 equ 0001h
PSMC3TMRL_PSMC3TMR5_LENGTH               equ 0001h
PSMC3TMRL_PSMC3TMR5_MASK                 equ 0020h
PSMC3TMRL_PSMC3TMR6_POSN                 equ 0006h
PSMC3TMRL_PSMC3TMR6_POSITION             equ 0006h
PSMC3TMRL_PSMC3TMR6_SIZE                 equ 0001h
PSMC3TMRL_PSMC3TMR6_LENGTH               equ 0001h
PSMC3TMRL_PSMC3TMR6_MASK                 equ 0040h
PSMC3TMRL_PSMC3TMR7_POSN                 equ 0007h
PSMC3TMRL_PSMC3TMR7_POSITION             equ 0007h
PSMC3TMRL_PSMC3TMR7_SIZE                 equ 0001h
PSMC3TMRL_PSMC3TMR7_LENGTH               equ 0001h
PSMC3TMRL_PSMC3TMR7_MASK                 equ 0080h

// Register: PSMC3TMRH
#define PSMC3TMRH PSMC3TMRH
PSMC3TMRH                                equ 0868h
// bitfield definitions
PSMC3TMRH_PSMC3TMR8_POSN                 equ 0000h
PSMC3TMRH_PSMC3TMR8_POSITION             equ 0000h
PSMC3TMRH_PSMC3TMR8_SIZE                 equ 0001h
PSMC3TMRH_PSMC3TMR8_LENGTH               equ 0001h
PSMC3TMRH_PSMC3TMR8_MASK                 equ 0001h
PSMC3TMRH_PSMC3TMR9_POSN                 equ 0001h
PSMC3TMRH_PSMC3TMR9_POSITION             equ 0001h
PSMC3TMRH_PSMC3TMR9_SIZE                 equ 0001h
PSMC3TMRH_PSMC3TMR9_LENGTH               equ 0001h
PSMC3TMRH_PSMC3TMR9_MASK                 equ 0002h
PSMC3TMRH_PSMC3TMR10_POSN                equ 0002h
PSMC3TMRH_PSMC3TMR10_POSITION            equ 0002h
PSMC3TMRH_PSMC3TMR10_SIZE                equ 0001h
PSMC3TMRH_PSMC3TMR10_LENGTH              equ 0001h
PSMC3TMRH_PSMC3TMR10_MASK                equ 0004h
PSMC3TMRH_PSMC3TMR11_POSN                equ 0003h
PSMC3TMRH_PSMC3TMR11_POSITION            equ 0003h
PSMC3TMRH_PSMC3TMR11_SIZE                equ 0001h
PSMC3TMRH_PSMC3TMR11_LENGTH              equ 0001h
PSMC3TMRH_PSMC3TMR11_MASK                equ 0008h
PSMC3TMRH_PSMC3TMR12_POSN                equ 0004h
PSMC3TMRH_PSMC3TMR12_POSITION            equ 0004h
PSMC3TMRH_PSMC3TMR12_SIZE                equ 0001h
PSMC3TMRH_PSMC3TMR12_LENGTH              equ 0001h
PSMC3TMRH_PSMC3TMR12_MASK                equ 0010h
PSMC3TMRH_PSMC3TMR13_POSN                equ 0005h
PSMC3TMRH_PSMC3TMR13_POSITION            equ 0005h
PSMC3TMRH_PSMC3TMR13_SIZE                equ 0001h
PSMC3TMRH_PSMC3TMR13_LENGTH              equ 0001h
PSMC3TMRH_PSMC3TMR13_MASK                equ 0020h
PSMC3TMRH_PSMC3TMR14_POSN                equ 0006h
PSMC3TMRH_PSMC3TMR14_POSITION            equ 0006h
PSMC3TMRH_PSMC3TMR14_SIZE                equ 0001h
PSMC3TMRH_PSMC3TMR14_LENGTH              equ 0001h
PSMC3TMRH_PSMC3TMR14_MASK                equ 0040h
PSMC3TMRH_PSMC3TMR15_POSN                equ 0007h
PSMC3TMRH_PSMC3TMR15_POSITION            equ 0007h
PSMC3TMRH_PSMC3TMR15_SIZE                equ 0001h
PSMC3TMRH_PSMC3TMR15_LENGTH              equ 0001h
PSMC3TMRH_PSMC3TMR15_MASK                equ 0080h

// Register: PSMC3DBR
#define PSMC3DBR PSMC3DBR
PSMC3DBR                                 equ 0869h
// bitfield definitions
PSMC3DBR_PSMC3DBR0_POSN                  equ 0000h
PSMC3DBR_PSMC3DBR0_POSITION              equ 0000h
PSMC3DBR_PSMC3DBR0_SIZE                  equ 0001h
PSMC3DBR_PSMC3DBR0_LENGTH                equ 0001h
PSMC3DBR_PSMC3DBR0_MASK                  equ 0001h
PSMC3DBR_PSMC3DBR1_POSN                  equ 0001h
PSMC3DBR_PSMC3DBR1_POSITION              equ 0001h
PSMC3DBR_PSMC3DBR1_SIZE                  equ 0001h
PSMC3DBR_PSMC3DBR1_LENGTH                equ 0001h
PSMC3DBR_PSMC3DBR1_MASK                  equ 0002h
PSMC3DBR_PSMC3DBR2_POSN                  equ 0002h
PSMC3DBR_PSMC3DBR2_POSITION              equ 0002h
PSMC3DBR_PSMC3DBR2_SIZE                  equ 0001h
PSMC3DBR_PSMC3DBR2_LENGTH                equ 0001h
PSMC3DBR_PSMC3DBR2_MASK                  equ 0004h
PSMC3DBR_PSMC3DBR3_POSN                  equ 0003h
PSMC3DBR_PSMC3DBR3_POSITION              equ 0003h
PSMC3DBR_PSMC3DBR3_SIZE                  equ 0001h
PSMC3DBR_PSMC3DBR3_LENGTH                equ 0001h
PSMC3DBR_PSMC3DBR3_MASK                  equ 0008h
PSMC3DBR_PSMC3DBR4_POSN                  equ 0004h
PSMC3DBR_PSMC3DBR4_POSITION              equ 0004h
PSMC3DBR_PSMC3DBR4_SIZE                  equ 0001h
PSMC3DBR_PSMC3DBR4_LENGTH                equ 0001h
PSMC3DBR_PSMC3DBR4_MASK                  equ 0010h
PSMC3DBR_PSMC3DBR5_POSN                  equ 0005h
PSMC3DBR_PSMC3DBR5_POSITION              equ 0005h
PSMC3DBR_PSMC3DBR5_SIZE                  equ 0001h
PSMC3DBR_PSMC3DBR5_LENGTH                equ 0001h
PSMC3DBR_PSMC3DBR5_MASK                  equ 0020h
PSMC3DBR_PSMC3DBR6_POSN                  equ 0006h
PSMC3DBR_PSMC3DBR6_POSITION              equ 0006h
PSMC3DBR_PSMC3DBR6_SIZE                  equ 0001h
PSMC3DBR_PSMC3DBR6_LENGTH                equ 0001h
PSMC3DBR_PSMC3DBR6_MASK                  equ 0040h
PSMC3DBR_PSMC3DBR7_POSN                  equ 0007h
PSMC3DBR_PSMC3DBR7_POSITION              equ 0007h
PSMC3DBR_PSMC3DBR7_SIZE                  equ 0001h
PSMC3DBR_PSMC3DBR7_LENGTH                equ 0001h
PSMC3DBR_PSMC3DBR7_MASK                  equ 0080h

// Register: PSMC3DBF
#define PSMC3DBF PSMC3DBF
PSMC3DBF                                 equ 086Ah
// bitfield definitions
PSMC3DBF_PSMC3DBF0_POSN                  equ 0000h
PSMC3DBF_PSMC3DBF0_POSITION              equ 0000h
PSMC3DBF_PSMC3DBF0_SIZE                  equ 0001h
PSMC3DBF_PSMC3DBF0_LENGTH                equ 0001h
PSMC3DBF_PSMC3DBF0_MASK                  equ 0001h
PSMC3DBF_PSMC3DBF1_POSN                  equ 0001h
PSMC3DBF_PSMC3DBF1_POSITION              equ 0001h
PSMC3DBF_PSMC3DBF1_SIZE                  equ 0001h
PSMC3DBF_PSMC3DBF1_LENGTH                equ 0001h
PSMC3DBF_PSMC3DBF1_MASK                  equ 0002h
PSMC3DBF_PSMC3DBF2_POSN                  equ 0002h
PSMC3DBF_PSMC3DBF2_POSITION              equ 0002h
PSMC3DBF_PSMC3DBF2_SIZE                  equ 0001h
PSMC3DBF_PSMC3DBF2_LENGTH                equ 0001h
PSMC3DBF_PSMC3DBF2_MASK                  equ 0004h
PSMC3DBF_PSMC3DBF3_POSN                  equ 0003h
PSMC3DBF_PSMC3DBF3_POSITION              equ 0003h
PSMC3DBF_PSMC3DBF3_SIZE                  equ 0001h
PSMC3DBF_PSMC3DBF3_LENGTH                equ 0001h
PSMC3DBF_PSMC3DBF3_MASK                  equ 0008h
PSMC3DBF_PSMC3DBF4_POSN                  equ 0004h
PSMC3DBF_PSMC3DBF4_POSITION              equ 0004h
PSMC3DBF_PSMC3DBF4_SIZE                  equ 0001h
PSMC3DBF_PSMC3DBF4_LENGTH                equ 0001h
PSMC3DBF_PSMC3DBF4_MASK                  equ 0010h
PSMC3DBF_PSMC3DBF5_POSN                  equ 0005h
PSMC3DBF_PSMC3DBF5_POSITION              equ 0005h
PSMC3DBF_PSMC3DBF5_SIZE                  equ 0001h
PSMC3DBF_PSMC3DBF5_LENGTH                equ 0001h
PSMC3DBF_PSMC3DBF5_MASK                  equ 0020h
PSMC3DBF_PSMC3DBF6_POSN                  equ 0006h
PSMC3DBF_PSMC3DBF6_POSITION              equ 0006h
PSMC3DBF_PSMC3DBF6_SIZE                  equ 0001h
PSMC3DBF_PSMC3DBF6_LENGTH                equ 0001h
PSMC3DBF_PSMC3DBF6_MASK                  equ 0040h
PSMC3DBF_PSMC3DBF7_POSN                  equ 0007h
PSMC3DBF_PSMC3DBF7_POSITION              equ 0007h
PSMC3DBF_PSMC3DBF7_SIZE                  equ 0001h
PSMC3DBF_PSMC3DBF7_LENGTH                equ 0001h
PSMC3DBF_PSMC3DBF7_MASK                  equ 0080h

// Register: PSMC3BLKR
#define PSMC3BLKR PSMC3BLKR
PSMC3BLKR                                equ 086Bh
// bitfield definitions
PSMC3BLKR_PSMC3BLKR0_POSN                equ 0000h
PSMC3BLKR_PSMC3BLKR0_POSITION            equ 0000h
PSMC3BLKR_PSMC3BLKR0_SIZE                equ 0001h
PSMC3BLKR_PSMC3BLKR0_LENGTH              equ 0001h
PSMC3BLKR_PSMC3BLKR0_MASK                equ 0001h
PSMC3BLKR_PSMC3BLKR1_POSN                equ 0001h
PSMC3BLKR_PSMC3BLKR1_POSITION            equ 0001h
PSMC3BLKR_PSMC3BLKR1_SIZE                equ 0001h
PSMC3BLKR_PSMC3BLKR1_LENGTH              equ 0001h
PSMC3BLKR_PSMC3BLKR1_MASK                equ 0002h
PSMC3BLKR_PSMC3BLKR2_POSN                equ 0002h
PSMC3BLKR_PSMC3BLKR2_POSITION            equ 0002h
PSMC3BLKR_PSMC3BLKR2_SIZE                equ 0001h
PSMC3BLKR_PSMC3BLKR2_LENGTH              equ 0001h
PSMC3BLKR_PSMC3BLKR2_MASK                equ 0004h
PSMC3BLKR_PSMC3BLKR3_POSN                equ 0003h
PSMC3BLKR_PSMC3BLKR3_POSITION            equ 0003h
PSMC3BLKR_PSMC3BLKR3_SIZE                equ 0001h
PSMC3BLKR_PSMC3BLKR3_LENGTH              equ 0001h
PSMC3BLKR_PSMC3BLKR3_MASK                equ 0008h
PSMC3BLKR_PSMC3BLKR4_POSN                equ 0004h
PSMC3BLKR_PSMC3BLKR4_POSITION            equ 0004h
PSMC3BLKR_PSMC3BLKR4_SIZE                equ 0001h
PSMC3BLKR_PSMC3BLKR4_LENGTH              equ 0001h
PSMC3BLKR_PSMC3BLKR4_MASK                equ 0010h
PSMC3BLKR_PSMC3BLKR5_POSN                equ 0005h
PSMC3BLKR_PSMC3BLKR5_POSITION            equ 0005h
PSMC3BLKR_PSMC3BLKR5_SIZE                equ 0001h
PSMC3BLKR_PSMC3BLKR5_LENGTH              equ 0001h
PSMC3BLKR_PSMC3BLKR5_MASK                equ 0020h
PSMC3BLKR_PSMC3BLKR6_POSN                equ 0006h
PSMC3BLKR_PSMC3BLKR6_POSITION            equ 0006h
PSMC3BLKR_PSMC3BLKR6_SIZE                equ 0001h
PSMC3BLKR_PSMC3BLKR6_LENGTH              equ 0001h
PSMC3BLKR_PSMC3BLKR6_MASK                equ 0040h
PSMC3BLKR_PSMC3BLKR7_POSN                equ 0007h
PSMC3BLKR_PSMC3BLKR7_POSITION            equ 0007h
PSMC3BLKR_PSMC3BLKR7_SIZE                equ 0001h
PSMC3BLKR_PSMC3BLKR7_LENGTH              equ 0001h
PSMC3BLKR_PSMC3BLKR7_MASK                equ 0080h

