GopalSaraf/Practicals/PSDL/include/proc/pic16f1786.inc
// Register: PSMC3BLKF
#define PSMC3BLKF PSMC3BLKF
PSMC3BLKF                                equ 086Ch
// bitfield definitions
PSMC3BLKF_PSMC3BLKF0_POSN                equ 0000h
PSMC3BLKF_PSMC3BLKF0_POSITION            equ 0000h
PSMC3BLKF_PSMC3BLKF0_SIZE                equ 0001h
PSMC3BLKF_PSMC3BLKF0_LENGTH              equ 0001h
PSMC3BLKF_PSMC3BLKF0_MASK                equ 0001h
PSMC3BLKF_PSMC3BLKF1_POSN                equ 0001h
PSMC3BLKF_PSMC3BLKF1_POSITION            equ 0001h
PSMC3BLKF_PSMC3BLKF1_SIZE                equ 0001h
PSMC3BLKF_PSMC3BLKF1_LENGTH              equ 0001h
PSMC3BLKF_PSMC3BLKF1_MASK                equ 0002h
PSMC3BLKF_PSMC3BLKF2_POSN                equ 0002h
PSMC3BLKF_PSMC3BLKF2_POSITION            equ 0002h
PSMC3BLKF_PSMC3BLKF2_SIZE                equ 0001h
PSMC3BLKF_PSMC3BLKF2_LENGTH              equ 0001h
PSMC3BLKF_PSMC3BLKF2_MASK                equ 0004h
PSMC3BLKF_PSMC3BLKF3_POSN                equ 0003h
PSMC3BLKF_PSMC3BLKF3_POSITION            equ 0003h
PSMC3BLKF_PSMC3BLKF3_SIZE                equ 0001h
PSMC3BLKF_PSMC3BLKF3_LENGTH              equ 0001h
PSMC3BLKF_PSMC3BLKF3_MASK                equ 0008h
PSMC3BLKF_PSMC3BLKF4_POSN                equ 0004h
PSMC3BLKF_PSMC3BLKF4_POSITION            equ 0004h
PSMC3BLKF_PSMC3BLKF4_SIZE                equ 0001h
PSMC3BLKF_PSMC3BLKF4_LENGTH              equ 0001h
PSMC3BLKF_PSMC3BLKF4_MASK                equ 0010h
PSMC3BLKF_PSMC3BLKF5_POSN                equ 0005h
PSMC3BLKF_PSMC3BLKF5_POSITION            equ 0005h
PSMC3BLKF_PSMC3BLKF5_SIZE                equ 0001h
PSMC3BLKF_PSMC3BLKF5_LENGTH              equ 0001h
PSMC3BLKF_PSMC3BLKF5_MASK                equ 0020h
PSMC3BLKF_PSMC3BLKF6_POSN                equ 0006h
PSMC3BLKF_PSMC3BLKF6_POSITION            equ 0006h
PSMC3BLKF_PSMC3BLKF6_SIZE                equ 0001h
PSMC3BLKF_PSMC3BLKF6_LENGTH              equ 0001h
PSMC3BLKF_PSMC3BLKF6_MASK                equ 0040h
PSMC3BLKF_PSMC3BLKF7_POSN                equ 0007h
PSMC3BLKF_PSMC3BLKF7_POSITION            equ 0007h
PSMC3BLKF_PSMC3BLKF7_SIZE                equ 0001h
PSMC3BLKF_PSMC3BLKF7_LENGTH              equ 0001h
PSMC3BLKF_PSMC3BLKF7_MASK                equ 0080h

// Register: PSMC3FFA
#define PSMC3FFA PSMC3FFA
PSMC3FFA                                 equ 086Dh
// bitfield definitions
PSMC3FFA_PSMC3FFA0_POSN                  equ 0000h
PSMC3FFA_PSMC3FFA0_POSITION              equ 0000h
PSMC3FFA_PSMC3FFA0_SIZE                  equ 0001h
PSMC3FFA_PSMC3FFA0_LENGTH                equ 0001h
PSMC3FFA_PSMC3FFA0_MASK                  equ 0001h
PSMC3FFA_PSMC3FFA1_POSN                  equ 0001h
PSMC3FFA_PSMC3FFA1_POSITION              equ 0001h
PSMC3FFA_PSMC3FFA1_SIZE                  equ 0001h
PSMC3FFA_PSMC3FFA1_LENGTH                equ 0001h
PSMC3FFA_PSMC3FFA1_MASK                  equ 0002h
PSMC3FFA_PSMC3FFA2_POSN                  equ 0002h
PSMC3FFA_PSMC3FFA2_POSITION              equ 0002h
PSMC3FFA_PSMC3FFA2_SIZE                  equ 0001h
PSMC3FFA_PSMC3FFA2_LENGTH                equ 0001h
PSMC3FFA_PSMC3FFA2_MASK                  equ 0004h
PSMC3FFA_PSMC3FFA3_POSN                  equ 0003h
PSMC3FFA_PSMC3FFA3_POSITION              equ 0003h
PSMC3FFA_PSMC3FFA3_SIZE                  equ 0001h
PSMC3FFA_PSMC3FFA3_LENGTH                equ 0001h
PSMC3FFA_PSMC3FFA3_MASK                  equ 0008h

// Register: PSMC3STR0
#define PSMC3STR0 PSMC3STR0
PSMC3STR0                                equ 086Eh
// bitfield definitions
PSMC3STR0_P3STRA_POSN                    equ 0000h
PSMC3STR0_P3STRA_POSITION                equ 0000h
PSMC3STR0_P3STRA_SIZE                    equ 0001h
PSMC3STR0_P3STRA_LENGTH                  equ 0001h
PSMC3STR0_P3STRA_MASK                    equ 0001h
PSMC3STR0_P3STRB_POSN                    equ 0001h
PSMC3STR0_P3STRB_POSITION                equ 0001h
PSMC3STR0_P3STRB_SIZE                    equ 0001h
PSMC3STR0_P3STRB_LENGTH                  equ 0001h
PSMC3STR0_P3STRB_MASK                    equ 0002h

// Register: PSMC3STR1
#define PSMC3STR1 PSMC3STR1
PSMC3STR1                                equ 086Fh
// bitfield definitions
PSMC3STR1_P3HSMEN_POSN                   equ 0000h
PSMC3STR1_P3HSMEN_POSITION               equ 0000h
PSMC3STR1_P3HSMEN_SIZE                   equ 0001h
PSMC3STR1_P3HSMEN_LENGTH                 equ 0001h
PSMC3STR1_P3HSMEN_MASK                   equ 0001h
PSMC3STR1_P3LSMEN_POSN                   equ 0001h
PSMC3STR1_P3LSMEN_POSITION               equ 0001h
PSMC3STR1_P3LSMEN_SIZE                   equ 0001h
PSMC3STR1_P3LSMEN_LENGTH                 equ 0001h
PSMC3STR1_P3LSMEN_MASK                   equ 0002h
PSMC3STR1_P3SSYNC_POSN                   equ 0007h
PSMC3STR1_P3SSYNC_POSITION               equ 0007h
PSMC3STR1_P3SSYNC_SIZE                   equ 0001h
PSMC3STR1_P3SSYNC_LENGTH                 equ 0001h
PSMC3STR1_P3SSYNC_MASK                   equ 0080h

// Register: STATUS_SHAD
#define STATUS_SHAD STATUS_SHAD
STATUS_SHAD                              equ 0FE4h
// bitfield definitions
STATUS_SHAD_C_SHAD_POSN                  equ 0000h
STATUS_SHAD_C_SHAD_POSITION              equ 0000h
STATUS_SHAD_C_SHAD_SIZE                  equ 0001h
STATUS_SHAD_C_SHAD_LENGTH                equ 0001h
STATUS_SHAD_C_SHAD_MASK                  equ 0001h
STATUS_SHAD_DC_SHAD_POSN                 equ 0001h
STATUS_SHAD_DC_SHAD_POSITION             equ 0001h
STATUS_SHAD_DC_SHAD_SIZE                 equ 0001h
STATUS_SHAD_DC_SHAD_LENGTH               equ 0001h
STATUS_SHAD_DC_SHAD_MASK                 equ 0002h
STATUS_SHAD_Z_SHAD_POSN                  equ 0002h
STATUS_SHAD_Z_SHAD_POSITION              equ 0002h
STATUS_SHAD_Z_SHAD_SIZE                  equ 0001h
STATUS_SHAD_Z_SHAD_LENGTH                equ 0001h
STATUS_SHAD_Z_SHAD_MASK                  equ 0004h

// Register: WREG_SHAD
#define WREG_SHAD WREG_SHAD
WREG_SHAD                                equ 0FE5h
// bitfield definitions
WREG_SHAD_WREG_SHAD_POSN                 equ 0000h
WREG_SHAD_WREG_SHAD_POSITION             equ 0000h
WREG_SHAD_WREG_SHAD_SIZE                 equ 0008h
WREG_SHAD_WREG_SHAD_LENGTH               equ 0008h
WREG_SHAD_WREG_SHAD_MASK                 equ 00FFh

// Register: BSR_SHAD
#define BSR_SHAD BSR_SHAD
BSR_SHAD                                 equ 0FE6h
// bitfield definitions
BSR_SHAD_BSR_SHAD_POSN                   equ 0000h
BSR_SHAD_BSR_SHAD_POSITION               equ 0000h
BSR_SHAD_BSR_SHAD_SIZE                   equ 0005h
BSR_SHAD_BSR_SHAD_LENGTH                 equ 0005h
BSR_SHAD_BSR_SHAD_MASK                   equ 001Fh

// Register: PCLATH_SHAD
#define PCLATH_SHAD PCLATH_SHAD
PCLATH_SHAD                              equ 0FE7h
// bitfield definitions
PCLATH_SHAD_PCLATH_SHAD_POSN             equ 0000h
PCLATH_SHAD_PCLATH_SHAD_POSITION         equ 0000h
PCLATH_SHAD_PCLATH_SHAD_SIZE             equ 0007h
PCLATH_SHAD_PCLATH_SHAD_LENGTH           equ 0007h
PCLATH_SHAD_PCLATH_SHAD_MASK             equ 007Fh

// Register: FSR0L_SHAD
#define FSR0L_SHAD FSR0L_SHAD
FSR0L_SHAD                               equ 0FE8h
// bitfield definitions
FSR0L_SHAD_FSR0L_SHAD_POSN               equ 0000h
FSR0L_SHAD_FSR0L_SHAD_POSITION           equ 0000h
FSR0L_SHAD_FSR0L_SHAD_SIZE               equ 0008h
FSR0L_SHAD_FSR0L_SHAD_LENGTH             equ 0008h
FSR0L_SHAD_FSR0L_SHAD_MASK               equ 00FFh

// Register: FSR0H_SHAD
#define FSR0H_SHAD FSR0H_SHAD
FSR0H_SHAD                               equ 0FE9h
// bitfield definitions
FSR0H_SHAD_FSR0H_SHAD_POSN               equ 0000h
FSR0H_SHAD_FSR0H_SHAD_POSITION           equ 0000h
FSR0H_SHAD_FSR0H_SHAD_SIZE               equ 0008h
FSR0H_SHAD_FSR0H_SHAD_LENGTH             equ 0008h
FSR0H_SHAD_FSR0H_SHAD_MASK               equ 00FFh

// Register: FSR1L_SHAD
#define FSR1L_SHAD FSR1L_SHAD
FSR1L_SHAD                               equ 0FEAh
// bitfield definitions
FSR1L_SHAD_FSR1L_SHAD_POSN               equ 0000h
FSR1L_SHAD_FSR1L_SHAD_POSITION           equ 0000h
FSR1L_SHAD_FSR1L_SHAD_SIZE               equ 0008h
FSR1L_SHAD_FSR1L_SHAD_LENGTH             equ 0008h
FSR1L_SHAD_FSR1L_SHAD_MASK               equ 00FFh

// Register: FSR1H_SHAD
#define FSR1H_SHAD FSR1H_SHAD
FSR1H_SHAD                               equ 0FEBh
// bitfield definitions
FSR1H_SHAD_FSR1H_SHAD_POSN               equ 0000h
FSR1H_SHAD_FSR1H_SHAD_POSITION           equ 0000h
FSR1H_SHAD_FSR1H_SHAD_SIZE               equ 0008h
FSR1H_SHAD_FSR1H_SHAD_LENGTH             equ 0008h
FSR1H_SHAD_FSR1H_SHAD_MASK               equ 00FFh

// Register: STKPTR
#define STKPTR STKPTR
STKPTR                                   equ 0FEDh
// bitfield definitions
STKPTR_STKPTR_POSN                       equ 0000h
STKPTR_STKPTR_POSITION                   equ 0000h
STKPTR_STKPTR_SIZE                       equ 0005h
STKPTR_STKPTR_LENGTH                     equ 0005h
STKPTR_STKPTR_MASK                       equ 001Fh

